oc/+Config.org

*  lexical
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

* 通过 git 查看 doom 配置是否有改动

#+begin_src emacs-lisp
;; (defun doom-ischange ()
;;   (interactive)
;;     (let
;;         (
;;         (default-directory "~/.doom.d/")
;;         (explicit-shell-file-name "E:/PowerShell/7/pwsh.exe"))
;;         ;;(message (shell-command-to-string "git status -s"))
;;         (shell-command-to-string "git status -s")
;;     )
;;   )


;; (setq start-org-doom-changelog (doom-ischange))

;; git -C e:/spacemacs/emacs26-3/.doom.d/ status -s 非在 git 目录下也可查看状态
#+end_src
- [[https://www.eigenbahn.com/2020/01/19/painless-emacs-shell-commands][Painless Emacs shell commands]]
  
* 启动速度

#+begin_src emacs-lisp
(defvar last-file-name-handler-alist file-name-handler-alist)
(setq gc-cons-threshold 402653184
      gc-cons-percentage 0.6
      file-name-handler-alist nil)

;; ... your whole emacs config here ...

;; after startup, it is important you reset this to some reasonable default. A large 
;; gc-cons-threshold will cause freezing and stuttering during long-term 
;; interactive use. I find these are nice defaults:
(add-hook! 'emacs-startup-hook
  (setq gc-cons-threshold 16777216
        gc-cons-percentage 0.1
        file-name-handler-alist last-file-name-handler-alist))


(defun compile-Org-to-elisp (file)
  (let ((tan (concat
             (file-name-sans-extension file) ".el")
            ))
    (org-babel-tangle-file file tan "emacs-lisp\\|elisp")
    (byte-compile-file tan)
    )
  )
(defun compile-my-config()
  (interactive)
(compile-Org-to-elisp "~/.doom.d/oc/+Config.org")
(compile-Org-to-elisp "~/.doom.d/oc/+KeyBinding.org")
(compile-Org-to-elisp "~/.doom.d/oc/+Org.org")
(compile-Org-to-elisp "~/.doom.d/oc/+Mode.org")
(byte-recompile-directory "~/.doom.d/oc/")
)

                

(add-hook 'kill-emacs-hook (lambda ()
                            (compile-Org-to-elisp "~/.doom.d/oc/+Config.org")
                            (compile-Org-to-elisp "~/.doom.d/oc/+KeyBinding.org")
                            (compile-Org-to-elisp "~/.doom.d/oc/+Org.org")
                            (compile-Org-to-elisp "~/.doom.d/oc/+Mode.org")
                            (byte-recompile-directory "~/.doom.d/oc/")
                             ;; (let ((last-org-doom-changelog (doom-ischange)))
                             ;;     ;;(f-write-text  last-org-doom-changelog 'utf-8
                             ;;     ;;            "E:\\spacemacs\\emacs26-3\\.doom.d\\t.txt")
                             ;;     ;;(f-write-text  start-org-doom-changelog 'utf-8
                             ;;     ;;            "E:\\spacemacs\\emacs26-3\\.doom.d\\s.txt")
                             ;;    (if (not (string= last-org-doom-changelog start-org-doom-changelog))
                             ;;        (progn
                             ;;        (compile-Org-to-elisp "e:/spacemacs/emacs26-3/.doom.d/oc/toOrg.org")
                             ;;        (compile-Org-to-elisp "e:/spacemacs/emacs26-3/.doom.d/oc/keybinding.org")
                             ;;        (compile-Org-to-elisp "e:/spacemacs/emacs26-3/.doom.d/oc/OrgConfig.org")
                             ;;        (compile-Org-to-elisp "e:/spacemacs/emacs26-3/.doom.d/oc/Mode.org")
                             ;;        (byte-recompile-directory "e:/spacemacs/emacs26-3/.doom.d/oc/")
                             ;;        )
                             ;;     )
                             ;;   )
                             ))


                        
#+end_src
- [[https://github.com/hlissner/doom-emacs/issues/4498][What is the correct way to profile Doom startup?]]


* Improve I/O

#+begin_src emacs-lisp
(when (boundp 'read-process-output-max)
  ;; 1MB in bytes, default 4096 bytes
  (setq read-process-output-max 1048576))
#+end_src

* 设置字体

#+begin_src emacs-lisp
(setq doom-font
      (font-spec :family "Cascadia Mono PL"
      ;;(font-spec :family "Source Code Variable"
      ;;(font-spec :family "Sarasa Mono TC Light"
      ;;            :size 18
       )
      )
#+end_src
* 窗口最大化

#+begin_src emacs-lisp
(add-hook 'window-setup-hook #'toggle-frame-fullscreen)
#+end_src
- [[https://emacs-china.org/t/doom-emacs/10434][doom emacs 如何设置启动后窗口的大小?]]

* 窗口透明

#+begin_src emacs-lisp
 ;;transparent adjustment
 (set-frame-parameter (selected-frame)'alpha '(90 . 90))
 (add-to-list 'default-frame-alist'(alpha . (90 . 90)))
#+end_src
- R:
  - =M-x doom/set-frame-opacity=
  - [[https://www.reddit.com/r/emacs/comments/8oongp/making_the_background_transparent_but_not_the/][Making the background transparent but not the text in emacs?]]
  - [[https://emacs-china.org/t/topic/2405][Emacs 透明窗口]]

* SPA 选择窗口

#+begin_src emacs-lisp
;;(map! :leader
;;  "0" 'winum-select-window-0-or-10
;;  "1" 'winum-select-window-1
;;  "2" 'winum-select-window-2
;;  "3" 'winum-select-window-3
;;  "4" 'winum-select-window-4
;;  "8" 'split-window-below
;;  "9" 'split-window-right
;;  )
#+end_src

*  使用系统废纸篓删除文件

#+begin_src emacs-lisp
;;(setq delete-by-moving-to-trash t)
#+end_src

* 闲置时 idle time 执行 recent-cleanup

#+begin_src emacs-lisp
;;(setq delete-by-moving-to-trash t)
#+end_src
- [[https://emacs.stackexchange.com/questions/22692/effect-of-multiple-idle-timers][Effect of multiple idle timers]]

* 修改启动页面的图片
#+begin_src emacs-lisp
;;(setq fancy-splash-image "~/.doom.d/banner/hack.png")
#+end_src

* 每个窗口添加边距
#+begin_src emacs-lisp
;; (add-hook 'after-change-major-mode-hook
;; (add-hook 'makrdown-mode-hook
;;           (lambda ()
;;                 (setq line-spacing 0.1)
;;                 ;; (setq header-line-format " ")
;;                 (setq left-margin-width 2)
;;                 (setq right-margin-width 2)
;;             )
;;           )
(setq-default line-spacing 0.2)                ;行间距
(setq-default left-margin-width 1 right-margin-width 1)
(set-window-buffer nil (current-buffer))
#+end_src
* 通过将窗口分割线与背景色一样来隐藏窗口分割线
#+begin_src emacs-lisp
;; (set-face-foreground 'vertical-border "#282c34")
(set-face-foreground 'vertical-border "black")
#+end_src

* awesome-tray-mode
#+begin_src emacs-lisp
(global-hide-mode-line-mode 1)
(require 'awesome-tray)
(awesome-tray-mode 1)
(setq
 awesome-tray-active-modules '("mode-name" "location" "buffer-name")
 awesome-tray-mode-line-active-color "White"
 )
#+end_src

* 自动显示换行
#+begin_src emacs-lisp
(global-visual-line-mode t)
#+end_src
- [[https://stackoverflow.com/questions/3281581/how-can-i-enable-line-wrap-on-word-boundaries-only-in-emacs][How can I enable line wrap on word boundaries only in Emacs?]]

* English
#+begin_src emacs-lisp
(require 'insert-translated-name)
(setq insert-translated-name-translate-engine "youdao")

(require 'company-english-helper)
#+end_src
